<a href="https://colab.research.google.com/github/garestrear/introduccion_ML_cursoUN/blob/main/Sesion2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from urllib.request import urlretrieve
url = 'https://ndownloader.figshare.com/files/2292172'
urlretrieve(url, 'surveys.csv')

('surveys.csv', <http.client.HTTPMessage at 0x7f18a5c32e50>)

# **¡¡Bienvenidos!!**


En esta primera sesión vamos a aprender:


*   DataFrames.
*   Manejo de bases de datos.
*   Herramientas descriptivas de bases de datos.
*   Limpieza y preparación de bases de datos para análisis más elaborados.

Para desarrollar todo esto haremos uso de la biblioteca de Python llamada Pandas.

**Pandas** es una librería (biblioteca) de Python para el análisis y la manipulación de conjuntos de datos. Con Pandas podemos estructurar las bases de datos para tener un manejo más rápido y más claro de los datos.

Su nombre se deriva del término "*panel data*" usado en econometría para conjuntos de datos que incluyen observaciones sobre múltiples periodos de tiempo para los mismos individuos.

La herramienta más importante en el manejo de bases de datos usando **Pandas** es el uso de los **DataFrames**. Primero nos familizaremos con esta nueva estructura para así poder usar sus propiedades.

# **1. Lo primero: ¿Qué es un DataFrame?**
![alt text](https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png)

Un **DataFrame** es una estructura de datos de dos dimensiones (filas y columnas) indexadas, parecidos a una tabla, una matriz o una hoja de cálculo de excel.

Las filas están indexadas con números naturales. Por ejemplo, en el **DataFrame** tenemos que las filas están indexadas desde el 0 hasta el 6 y las columnas están indexadas desde el 0 hasta el 4 (por qué?).

Las columnas también estarán indexadas por el nombre de la respectiva columna, por ejemplo, con los nombres *Name*, *Team*, *Number*...
Y los elementos dentro del **DataFrame** son los datos.

# **2. ¡A la carga!**
Vamos a cargar nuestra primera (y no la última) base de datos. Para esto debemos hacer lo siguiente (casi siempre):


1.   Cargar nuestra biblioteca **Pandas**.
2.   Cargar nuestra base de datos usando el siguiente comando: ``` pd.read_csv("name.csv") ```

En este caso vamos a cargar una base de datos que está en formato csv (*comma-separated values*). En este tipo de archivo de texto cada línea es una fila del **DataFrame** y cada dato está separado de otro dato por una coma.

In [ ]:
import pandas as pd

In [ ]:
primer_df = pd.read_csv("surveys.csv")
#primer_df.to_excel("nuevabase.xlsx")

Listo! Así de fácil cargamos nuestra primera base de datos. Para visualizarla solo debemos escribir el nombre de la variable donde guardamos nuestra base de datos:
```
primer_df
```

In [ ]:
primer_df

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
0              1      7   16  1977  ...          NL    M            32.0     NaN
1              2      7   16  1977  ...          NL    M            33.0     NaN
2              3      7   16  1977  ...          DM    F            37.0     NaN
3              4      7   16  1977  ...          DM    M            36.0     NaN
4              5      7   16  1977  ...          DM    M            35.0     NaN
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[35549 rows x 9 columns]

En caso de que tengamos nuestros datos en una hoja de **excel** podemos cargarlos usando el siguiente comando:

``` excel_df = pd.read_excel("name.xlsx", sheet_name = "nombre_hoja")```

Para más información los invitamos a consultar la documentación de **Pandas** para leer archivos de excel: [por ejemplo aquí.](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)

En este caso Python nos muestra las primeras 5 filas y las últimas 5 filas. También podemos escribir los siguientes comandos:
* ``` primer_df.head(6) ```
* ``` primer_df.tail(6) ```
* ``` primer_df.sample(7) ```

¿Qué resultado obtuviste?

In [ ]:
primer_df.head(8)

   record_id  month  day  year  plot_id species_id sex  hindfoot_length  weight
0          1      7   16  1977        2         NL   M             32.0     NaN
1          2      7   16  1977        3         NL   M             33.0     NaN
2          3      7   16  1977        2         DM   F             37.0     NaN
3          4      7   16  1977        7         DM   M             36.0     NaN
4          5      7   16  1977        3         DM   M             35.0     NaN
5          6      7   16  1977        1         PF   M             14.0     NaN
6          7      7   16  1977        2         PE   F              NaN     NaN
7          8      7   16  1977        1         DM   M             37.0     NaN

In [ ]:
primer_df.tail(6)

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
35543      35544     12   31  2002  ...          US  NaN             NaN     NaN
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[6 rows x 9 columns]

In [ ]:
primer_df.sample(7)

       record_id  month  day  year  ...  species_id sex hindfoot_length  weight
26809      26810      9   27  1997  ...          PE   F            21.0    20.0
8566        8567     11   12  1983  ...          DS   M            52.0   132.0
1405        1406     11    4  1978  ...          DM   F            37.0    38.0
32691      32692      9   22  2001  ...          NL   M            29.0   185.0
23168      23169     12   21  1995  ...          DM   F            36.0    44.0
31042      31043      7    2  2000  ...          PB   M            26.0    38.0
30111      30112     12    6  1999  ...          PP   M            21.0    12.0

[7 rows x 9 columns]

Para conocer más sobre cómo cargar datos csv, te invito a consultar la documentación de python [aquí.](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)

# **3. Sobre nuestros datos.**

Lo más importante en el manejo de bases de datos es conocer los datos. Veremos que muchas cosas dependen del conocimiento del analista de datos y de las decisiones que tome (muchas de estas subjetivas). Por esto vamos a dar una pequeña descripción sobre los datos que usamos en esta lección.


Para esta sesión usamos los datos de *“Portal Teaching”* que son subconjunto de los datos estudiados por Ernst et al. [Long-term monitoring and experimental manipulation of a Chihuahuan Desert ecosystem near Portal, Arizona, USA.](http://www.esapubs.org/archive/ecol/E090/118/default.htm)


Los datos pueden ser descargados desde la página [surveys.csv](https://ndownloader.figshare.com/files/2292172).


Vamos a estudiar la especie y el peso de los animales capturados en sitios dentro de nuestra área de estudio. El conjunto de datos esta guardado en un archivo .csv: cada línea tiene información sobre un solo animal y las columnas representan:

Columna. | Descripción.
--- | ---
record_id | identificador único de la observación
month | 	mes de observación
day | día de la observación
year | año de la observación
plot_id | 	ID de un sitio en particular
species_id | código de dos letras
sex | sexo del animal (“M”, “F”)
hindfoot_length | tamaño de pata en mm
weight | peso del animal en gramos

## **3.5 Objetivos.**



*   ¿Cuántas especies de cada sexo hay?
*   ¿Cuánto tiempo pasó desde que se hizo la primera observación hasta que se hizo la última de cada una de las especies?
*   ¿Existe algún valor atípico (*outlier*) en el peso de cada especie?

# **4. Conociendo los datos desde Python.**

Python tiene comandos que nos permiten hacernos una idea de nuestra base de datos. A continuación describimos algunos de estos.

## ```df.describe(percentiles = [0.25, 0.5, 0.75])```

Nos arroja una descripción estadística de nuestros datos.

*   **count**: número de datos en cada columna.
*   **mean**: la media de cada columna numérica.
*   **std**: desviación estandar de cada columna numérica.
*   **min**: el mínimo dato (numérico) de cada columna.
*   **percentiles**: estos por *default* son 25%, 50% y 75%. Los podemos modificar. Recuerde que el percentil 50% es la mediana.
*   **max**: el máximo dato (numérico) de cada columna.

In [ ]:
primer_df.describe(percentiles=[0.3, 0.6,0.9])

          record_id         month  ...  hindfoot_length        weight
count  35549.000000  35549.000000  ...     31438.000000  32283.000000
mean   17775.000000      6.477847  ...        29.287932     42.672428
std    10262.256696      3.396925  ...         9.564759     36.631259
min        1.000000      1.000000  ...         2.000000      4.000000
30%    10665.400000      4.000000  ...        21.000000     23.000000
50%    17775.000000      6.000000  ...        32.000000     37.000000
60%    21329.800000      7.000000  ...        35.000000     42.000000
90%    31994.200000     11.000000  ...        38.000000     87.000000
max    35549.000000     12.000000  ...        70.000000    280.000000

[9 rows x 7 columns]

## ```df.info()```

Este comando nos da información del total de datos y tipo de datos de nuestra base de datos.

*   **RangeIndex**: total de filas y su rango de índices.
*   **Data columns**: número total de columnas.
*   **Non-Null Count**: el número de datos con entradas no nulas, es decir, sin entradas NaN.
*   **Dtype**: tipo de dato en cada columna.
*   **dtypes**: dice cuantas columnas hay con cierto tipo de datos.
*   **memory usage**: uso de memorio hecho por este conjunto de datos.

In [ ]:
primer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       34786 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB

#  ¿Cuántas obsevaciones distintas hay en cada columna?

Recuerde que nuestro primer objetivo es:

*   Cuantas especies de cada sexo hay?

Para esto debemos estar seguros que nuestros datos están correctos, es decir, que todas las especies de sexo femenino estén únicamente determinadas por una "F" y lo mismo para los machos ("M").

Para saber esto usamos la función ```pd.unique(primer_df['sex'])```. Esta función nos muestra los valores únicos que aparecen en la columna indicada.

In [ ]:
pd.unique(primer_df['sex'])

array(['M', 'F', nan, 'Ff', 'Fem', 'Fff', 'Ma', 'Mm', 'MM'], dtype=object)

## ¿Dónde están los datos NaN?

Usando ```df.info()``` ya sabemos cuantos datos hay en total y cuantos de ellos son no nulos. A continuación veremos cuantos **sí** son nulos y veremos como seleccionarlos.

*   Para saber cuántos son nulos solo debemos hacer ```df.isna().sum()```.

*   Para seleccionar las filas de una columna de nombre *prueba* cuyas entradas son NaN solo debemos hacer ```df["prueba"].isna()```

In [ ]:
primer_df.isna().sum()

record_id             0
month                 0
day                   0
year                  0
plot_id               0
species_id          763
sex                2511
hindfoot_length    4111
weight             3266
dtype: int64

In [ ]:
primer_df["sex"].isna()

0        False
1        False
2        False
3        False
4        False
         ...
35544     True
35545     True
35546    False
35547    False
35548     True
Name: sex, Length: 35549, dtype: bool

Aqui vemos que ```primer_df["sex"].isna()``` pone True en las filas donde sí hay un dato NaN y False donde no lo hay. Con esto ya podemos hacer una iteración sobre los que son True o trabajar solo con los que son False. Esto lo veremos más adelante.

Seleccionar solo los que tienen NaN.

## Media, Moda y Mediana.

Para calcular cada uno de estos valores estadísticos tenemos los siguiente comandos:

* Media: ```df['columna'].mean()```
* Moda: ```df['columna'].mode()```
* Mediana: ```df['columna'].median()```

**Nota**: en cada uno Python omite los datos cuya entrada es NaN.

In [ ]:
print(primer_df['hindfoot_length'].mean(skipna=False))
print(primer_df['hindfoot_length'].mode())
print(primer_df['hindfoot_length'].median(skipna=False))

nan
0    36.0
dtype: float64
nan

## ¿Cuántos datos hay en cada columna?

Para confirmar lo anterios sería bueno saber cuántos diferentes datos aparecen una columna. Para esto hacemos
> ```df['columna'].value_counts()```

In [ ]:
primer_df['hindfoot_length'].value_counts()

36.0    4071
37.0    3277
35.0    2649
21.0    2504
20.0    2304
22.0    1704
16.0    1538
26.0    1359
34.0    1358
17.0    1285
38.0     888
19.0     780
27.0     762
15.0     736
33.0     675
25.0     606
23.0     598
32.0     430
50.0     391
18.0     385
51.0     376
49.0     358
52.0     311
48.0     239
24.0     222
31.0     206
39.0     201
14.0     201
28.0     195
47.0     178
30.0     132
53.0     122
29.0      83
46.0      62
54.0      58
13.0      42
12.0      36
40.0      27
45.0      24
11.0      17
55.0      12
44.0       5
41.0       4
43.0       4
10.0       3
8.0        3
9.0        3
58.0       2
57.0       2
6.0        2
42.0       2
7.0        2
56.0       1
70.0       1
2.0        1
64.0       1
Name: hindfoot_length, dtype: int64

# **5. Subconjuntos de DataFrames, agregar nuevos datos o unir con otro DataFrame.**

Para seleccionar solo una o varias columnas debemos escribir el nombre de las columnas como una lista.

 > ``` df[["columna1", "columna2"]]```


> ``` df[["columna"]] ```

* Crea un nuevo DataFrame con las columnas *sex* y *hindfoot_length*.

* Crea un nuevo DataFrame con la columna *weight*.

In [ ]:
df_sex_hindfoot = primer_df[["sex", "hindfoot_length"]]
df_sex_hindfoot

       sex  hindfoot_length
0        M             32.0
1        M             33.0
2        F             37.0
3        M             36.0
4        M             35.0
...    ...              ...
35544  NaN              NaN
35545  NaN              NaN
35546    F             15.0
35547    M             36.0
35548  NaN              NaN

[35549 rows x 2 columns]

In [ ]:
df_weight = primer_df[["weight"]]
df_weight

       weight
0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
...       ...
35544     NaN
35545     NaN
35546    14.0
35547    51.0
35548     NaN

[35549 rows x 1 columns]

Para elegir las filas con cierta propiedad solo debemos pedirle a Python que haga el filtro que queremos
>  ```df.loc[["column"] == condition]```

Por ejemplo vamos a seleccionar las filas cuya columna *sex* tiene el dato "F", es decir, las especies de sexo femenino.

In [ ]:
femeninas = primer_df.loc[primer_df["sex"]=="F"]
femeninas

       record_id  month  day  year  ...  species_id sex hindfoot_length  weight
2              3      7   16  1977  ...          DM   F            37.0     NaN
6              7      7   16  1977  ...          PE   F             NaN     NaN
8              9      7   16  1977  ...          DM   F            34.0     NaN
9             10      7   16  1977  ...          PF   F            20.0     NaN
10            11      7   16  1977  ...          DS   F            53.0     NaN
...          ...    ...  ...   ...  ...         ...  ..             ...     ...
35539      35540     12   31  2002  ...          PB   F            26.0    23.0
35540      35541     12   31  2002  ...          PB   F            24.0    31.0
35541      35542     12   31  2002  ...          PB   F            26.0    29.0
35542      35543     12   31  2002  ...          PB   F            27.0    34.0
35546      35547     12   31  2002  ...          RM   F            15.0    14.0

[15685 rows x 9 columns]

Y si queremos un solo dato en particular, digamos, el dato de la fila 2 y la columna *hindfoot_length* podemos hacerlos usando los índices de la fila y la columna 
> ```primer_df.iloc[2,7]```

O usando el nombre de la columna y el índice de la fila

> ```primer_df.loc[2,"hindfoot_length"]```

In [ ]:
primer_df.iloc[2,7]

37.0

In [ ]:
primer_df.loc[2,"hindfoot_length"]

37.0

## Y si queremos agregar nuevos datos?

Suponga que seguimos recolectando datos y ahora tenemos los siguientes datos


record_id | month | day | year | plot_id | species_id | sex | hindfoot_length | weight
--- | --- | --- | --- | --- | --- | --- | --- | --- 
35550 | 04 | 27 | 2017 | 7 | "NL" | "F" |  12 | 21
35551 | 03 | 07 | 2014 | 17 | "NM" | "M" |  13 | 23
35552 | 11 | 02 | 2017 | 23 | "NF" | "M" |  15 | 25
35553 | 09 | 23 | 2017 | 12 | "NL" | "F" |  14 | --

Vamos a crear un nuevo DataFrame con estos datos y posteriormente vamos a adicionar estos datos a nuestro DataFrame completo.

Para esto haremos lo siguiente:
*   Cargar la libreria Numpy con el alias de *np*.
*   Crear un diccionario cuyas llaves sean cada columna y los a cada llave le asignamos los datos de cada columna.
*   Finalmente usamos el comando ```pd.DataFrame(diccionario)```

In [ ]:
import numpy as np

In [ ]:
diccionario = {"record_id" : [35550, 35551, 35552, 35553], "month" : [4, 3, 11, 9], "day" : [27, 7, 2, 23],
               "year" : [2017, 2014, 2017, 2017], "species_id":["NL", "NM", "NF", "NL"], "sex" :["F", "M", "M", "F"],
               "hindfoot_length" : [12, 13, 15, 14], "weight" : [21, 23, 25, float("NaN")]}#np.NaN

In [ ]:
diccionario

{'day': [27, 7, 2, 23],
 'hindfoot_length': [12, 13, 15, 14],
 'month': [4, 3, 11, 9],
 'record_id': [35550, 35551, 35552, 35553],
 'sex': ['F', 'M', 'M', 'F'],
 'species_id': ['NL', 'NM', 'NF', 'NL'],
 'weight': [21, 23, 25, nan],
 'year': [2017, 2014, 2017, 2017]}

In [ ]:
type(diccionario["weight"][3])

float

In [ ]:
nuevos_datos = pd.DataFrame(diccionario)
nuevos_datos

   record_id  month  day  year species_id sex  hindfoot_length  weight
0      35550      4   27  2017         NL   F               12    21.0
1      35551      3    7  2014         NM   M               13    23.0
2      35552     11    2  2017         NF   M               15    25.0
3      35553      9   23  2017         NL   F               14     NaN

*   Ahora adiccionamos los nuevos datos usando el comando *append*
> ``` base_nueva = df.append(nuevos_datos)```

In [ ]:
base_actualizada = primer_df.append(nuevos_datos, ignore_index=True)
base_actualizada

       record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
0              1      7   16  1977  ...          NL    M            32.0     NaN
1              2      7   16  1977  ...          NL    M            33.0     NaN
2              3      7   16  1977  ...          DM    F            37.0     NaN
3              4      7   16  1977  ...          DM    M            36.0     NaN
4              5      7   16  1977  ...          DM    M            35.0     NaN
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN
35549      35550      4   27  2017  ...          NL    F            12.0    21.0
35550      35551      3    7  2014  ...          NM    M            13.0    23.0
35551      35552     11    2  2017  ...          NF    M            15.0    25.0
35552      35553      9   23  2017  ...          NL    F            14.0     NaN

[35553 rows x 9 columns]

## Ahora vamos a agregar una columna.

Note que en nuestro conjunto de datos tenemos las columnas día, mes y año. Vamos a crear una nueva columna que se llame *date* cuyas entradas sean el día + mes + año.

Haremos lo siguiente:
*  Crear un arreglo cuya entrada sea ```day-month-year``` de cada una de las filas.
*  Luego crearemos una nueva columna en nuestro DataFrame que se llame *date* y cuyos valores sean el arreglo que creamos antes.
> ```base_actualizada["date"]=arreglo```

In [ ]:
arreglo = [str(base_actualizada.loc[i,"day"]) +"-"+str(base_actualizada.loc[i,"month"])+"-"+ str(base_actualizada.loc[i,"year"]) for i in range(len(base_actualizada))]
#arreglo

In [ ]:
base_actualizada["date"]= arreglo

In [ ]:
base_actualizada

       record_id  month  day  year  ...  sex hindfoot_length weight        date
0              1      7   16  1977  ...    M            32.0    NaN   16-7-1977
1              2      7   16  1977  ...    M            33.0    NaN   16-7-1977
2              3      7   16  1977  ...    F            37.0    NaN   16-7-1977
3              4      7   16  1977  ...    M            36.0    NaN   16-7-1977
4              5      7   16  1977  ...    M            35.0    NaN   16-7-1977
...          ...    ...  ...   ...  ...  ...             ...    ...         ...
35548      35549     12   31  2002  ...  NaN             NaN    NaN  31-12-2002
35549      35550      4   27  2017  ...    F            12.0   21.0   27-4-2017
35550      35551      3    7  2014  ...    M            13.0   23.0    7-3-2014
35551      35552     11    2  2017  ...    M            15.0   25.0   2-11-2017
35552      35553      9   23  2017  ...    F            14.0    NaN   23-9-2017

[35553 rows x 10 columns]

#  **Agrupando datos**

Python tiene una herramienta que nos permite hacer agrupación de datos de acuerdo a algún valor. 

Como nuestros objetivos están planteados para ser respondidos por cada especie, debemos agrupar nuestro conjuntos de datos según la columna *species_id*.

> ```df.groupby('columna')```

Para más información pueden consultar [aquí.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html)

In [ ]:
base_actualizada.groupby('species_id')

El anterior código nos da un objeto que agrupa los datos. Con esto podemos (por ejemplo) calcular la media agrupada por especies.

In [ ]:
base_actualizada.groupby(['species_id', "sex"])[['weight', "hindfoot_length"]].mean()
#base_actualizada.groupby('species_id')[['weight']].apply(np.mean)

                    weight  hindfoot_length
species_id sex
AH         M           NaN              NaN
BA         F      9.161290        13.161290
           M      7.357143        12.642857
DM         F     41.611174        35.713355
           Fem         NaN        36.000000
           Ff          NaN        35.000000
           Fff   35.000000        34.000000
           M     44.353711        36.188262
           Ma    41.000000        36.000000
DO         F     48.531250        35.486334
           M     49.135102        35.698780
DS         F    117.749548        49.586603
           Ff          NaN        46.000000
           M    122.290984        50.303142
           Mm          NaN        49.000000
NF         M     25.000000        15.000000
NL         F    154.078101        31.963023
           M    165.652893        32.577434
NM         M     23.000000        13.000000
OL         F     31.065817        20.287671
           M     32.068410        20.758333
OT         F     24.830904        20.281649
           M     23.695382        20.257399
OX         F     21.000000        19.666667
           M     21.000000        18.800000
PB         F     30.210884        25.882675
           M     33.816498        26.431987
PE         F     22.822183        20.272059
           M     20.584906        20.132132
PF         F      7.974394        15.550624
           M      7.885287        15.620779
PH         F     30.850000        25.900000
           M     31.454545        25.545455
PI         M     19.428571        22.500000
PL         F     19.312500        19.750000
           M     18.684211        20.263158
PM         F     22.125668        20.279778
           M     20.801205        20.530021
PP         F     17.180670        21.676620
           M     17.184486        21.838643
PX         F     20.000000        19.000000
           M     18.000000        20.000000
RF         F     13.684211        17.527273
           M     12.444444        17.500000
RM         F     11.102196        16.391880
           M     10.121076        16.490347
           MM    13.000000        18.000000
RO         F     11.000000        14.750000
           M      9.500000        16.000000
RX         M     15.500000        18.500000
SF         F     69.000000        27.500000
           M     53.434783        26.347826
SH         F     78.756410        29.028169
           M     65.177419        27.983333
SO         F     55.322581        25.633333
           M     55.700000        25.727273
SS         F     57.000000              NaN
           M    130.000000              NaN

#  **6. Tipos de datos.**

Python maneja varios tipos de datos. Algunos de los más usados son:
*  *int64*: dato tipo entero, es decir, número entero, e.g., 1, 2, 3,... 
*  *float64*: dato tipo flotante, es decir, un número real, e.g., $ \pi $, 2.54, 3/4.
*   *object*: este tipo de dato representa una cadena o un número escrito como una cadena. Por ejemplo "3,14", "hola".
*   *datetime64[ns]*: datos tipo fecha.


¿Cómo podemos saber qué tipo de datos tiene nuestro DataFrame?

In [ ]:
base_actualizada.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35553 entries, 0 to 35552
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35553 non-null  int64
 1   month            35553 non-null  int64
 2   day              35553 non-null  int64
 3   year             35553 non-null  int64
 4   plot_id          35549 non-null  float64
 5   species_id       34790 non-null  object
 6   sex              33042 non-null  object
 7   hindfoot_length  31442 non-null  float64
 8   weight           32286 non-null  float64
 9   date             35553 non-null  object
dtypes: float64(3), int64(4), object(3)
memory usage: 2.7+ MB

##  Qué significa el 64 de int 64???

In [ ]:
base_actualizada.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id            float64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
date                object
dtype: object

In [ ]:
base_actualizada.loc[base_actualizada["date"]=="31-4-2000"]

Empty DataFrame
Columns: [record_id, month, day, year, plot_id, species_id, sex, hindfoot_length, weight, date]
Index: []

## ¿Y si quiero convertir un dato de un tipo a otro?

*  Para convertir una columna que tenga la estructura de fechas usamos el comando ``` pd.to_datetime(base_actualizada['fecha'])```


Para más información ver [aquí.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html)

In [ ]:
pd.to_datetime(base_actualizada['date'])

0       1977-07-16
1       1977-07-16
2       1977-07-16
3       1977-07-16
4       1977-07-16
           ...
35548   2002-12-31
35549   2017-04-27
35550   2014-07-03
35551   2017-02-11
35552   2017-09-23
Name: date, Length: 35553, dtype: datetime64[ns]

In [ ]:
base_actualizada.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id            float64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
date                object
dtype: object

In [ ]:
base_actualizada['date'] = pd.to_datetime(base_actualizada['date'])

In [ ]:
base_actualizada.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35553 entries, 0 to 35552
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35553 non-null  int64
 1   month            35553 non-null  int64
 2   day              35553 non-null  int64
 3   year             35553 non-null  int64
 4   plot_id          35549 non-null  float64
 5   species_id       34790 non-null  object
 6   sex              33042 non-null  object
 7   hindfoot_length  31442 non-null  float64
 8   weight           32286 non-null  float64
 9   date             35553 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(4), object(2)
memory usage: 2.7+ MB

*  Para convertir una columna de tipo int64 a float64 usamos el comando ```df['columna'].astype('float64')```


Para más ver [aquí.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html#pandas.DataFrame.astype)

In [ ]:
base_actualizada.month.astype('float64')
base_actualizada["month"].astype('float64')

0         7.0
1         7.0
2         7.0
3         7.0
4         7.0
         ...
35548    12.0
35549     4.0
35550     3.0
35551    11.0
35552     9.0
Name: month, Length: 35553, dtype: float64

De nuestra columna *date* en formato *datetime64[ns]* podemos obtener toda la información como mes, día, año e inclusive hora o minutos (si nuestra base tuviera dicha información).

Para ver el mes basta hacer ```df['date'].month```

In [ ]:
base_actualizada.loc[2,'date'].year

1977

In [ ]:
base_actualizada.loc[2,'date']

Timestamp('1977-07-16 00:00:00')

Teniendo en cuenta esto podemos quitar las columnas *month*, *day* y *year* de nuestro DataFrame. Para esto hacemos

> ```df.drop(columns = ['column1', 'column2'])```

Si queremos quitar algunas filas, usamos el índice de estas filas

> ```df.drop([1,4,5])```

In [ ]:
base_actualizada

       record_id  month  day  year  ...  sex hindfoot_length weight       date
0              1      7   16  1977  ...    M            32.0    NaN 1977-07-16
1              2      7   16  1977  ...    M            33.0    NaN 1977-07-16
2              3      7   16  1977  ...    F            37.0    NaN 1977-07-16
3              4      7   16  1977  ...    M            36.0    NaN 1977-07-16
4              5      7   16  1977  ...    M            35.0    NaN 1977-07-16
...          ...    ...  ...   ...  ...  ...             ...    ...        ...
35548      35549     12   31  2002  ...  NaN             NaN    NaN 2002-12-31
35549      35550      4   27  2017  ...    F            12.0   21.0 2017-04-27
35550      35551      3    7  2014  ...    M            13.0   23.0 2014-07-03
35551      35552     11    2  2017  ...    M            15.0   25.0 2017-02-11
35552      35553      9   23  2017  ...    F            14.0    NaN 2017-09-23

[35553 rows x 10 columns]

In [ ]:
base_actualizada.drop(columns = ['month', 'day', 'year'], inplace=True)

In [ ]:
base_actualizada

       record_id  plot_id species_id  sex  hindfoot_length  weight       date
0              1      2.0         NL    M             32.0     NaN 1977-07-16
1              2      3.0         NL    M             33.0     NaN 1977-07-16
2              3      2.0         DM    F             37.0     NaN 1977-07-16
3              4      7.0         DM    M             36.0     NaN 1977-07-16
4              5      3.0         DM    M             35.0     NaN 1977-07-16
...          ...      ...        ...  ...              ...     ...        ...
35548      35549      5.0        NaN  NaN              NaN     NaN 2002-12-31
35549      35550      NaN         NL    F             12.0    21.0 2017-04-27
35550      35551      NaN         NM    M             13.0    23.0 2014-07-03
35551      35552      NaN         NF    M             15.0    25.0 2017-02-11
35552      35553      NaN         NL    F             14.0     NaN 2017-09-23

[35553 rows x 7 columns]

In [ ]:
base_actualizada.drop([35552, 35551])

       record_id  plot_id species_id  sex  hindfoot_length  weight       date
0              1      2.0         NL    M             32.0     NaN 1977-07-16
1              2      3.0         NL    M             33.0     NaN 1977-07-16
2              3      2.0         DM    F             37.0     NaN 1977-07-16
3              4      7.0         DM    M             36.0     NaN 1977-07-16
4              5      3.0         DM    M             35.0     NaN 1977-07-16
...          ...      ...        ...  ...              ...     ...        ...
35546      35547     10.0         RM    F             15.0    14.0 2002-12-31
35547      35548      7.0         DO    M             36.0    51.0 2002-12-31
35548      35549      5.0        NaN  NaN              NaN     NaN 2002-12-31
35549      35550      NaN         NL    F             12.0    21.0 2017-04-27
35550      35551      NaN         NM    M             13.0    23.0 2014-07-03

[35551 rows x 7 columns]

#  **Apply y funciones Lambda.**

*  **Apply**: Esta función permite aplicarle una función a todo nuestro DataFrame o a una parte de nuestro DataFrame.

In [ ]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [ ]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [ ]:
import numpy as np
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

*  **Funciones lambda**: Este comando de la forma
> ```lambda x: f(x)```

nos permite crear funciones en una línea sin tener que hacer definiciones más grandes.
Estas funciones no quedan guardadas en la memoria.

In [ ]:
df["B"]=df["B"].apply(lambda x: x+3)
df

   A   B
0  4  12
1  4  12
2  4  12

In [ ]:
seno = lambda x: np.sin(x)
print(seno(1))

0.8414709848078965

In [ ]:
def funcion_seno (n):
  return np.sin(n)

funcion_seno(1)

0.8414709848078965

In [ ]:
funcion = lambda x,y: (3*x)+y
funcion(df["A"], df["B"])

0    24
1    24
2    24
dtype: int64

#  **7. Respondiendo los objetivos.**

*   ¿Cuántas especies de cada sexo hay?
*   ¿Cuánto tiempo pasó desde que se hizo la primera observación hasta que se hizo la última de cada una de las especies?
*   ¿Existe algún valor atípico (*outlier*) en el peso de cada especie?

##  ¿Cuantas especies de cada sexo hay?

Primero vamos a unificar la notación: vamos a reemplazar cualquier símbolo que represente femenino por una "F". Y lo mismo haremos para los machos.

In [ ]:
pd.unique(base_actualizada['sex'])

array(['M', 'F', nan, 'Ff', 'Fem', 'Fff', 'Ma', 'Mm', 'MM'], dtype=object)

In [ ]:
base_actualizada['sex']=base_actualizada['sex'].apply(lambda x: "F" if x in {"f", "F", "Ff", "Fem", "Fff"} else x)

In [ ]:
pd.unique(base_actualizada['sex'])

array(['M', 'F', nan, 'Ma', 'Mm', 'MM'], dtype=object)

In [ ]:
base_actualizada['sex']=base_actualizada['sex'].apply(lambda x: "M" if x in {"Ma", "Mm", "MM", "M"} else x)

In [ ]:
pd.unique(base_actualizada['sex'])

array(['M', 'F', nan], dtype=object)

Una vez tenemos los datos limpios, usamos un ```groupby``` para agrupar los datos por especies y en la columna *sex* contamos cuantos valores distintos hay con un ```value_counts()```.

In [ ]:
base_actualizada.groupby('species_id')['sex'].value_counts()

species_id  sex
AH          M         1
BA          F        31
            M        14
DM          M      5969
            F      4554
DO          M      1707
            F      1308
DS          M      1270
            F      1188
NF          M         1
NL          F       677
            M       502
NM          M         1
OL          M       512
            F       475
OT          M      1156
            F      1057
OX          M         5
            F         4
PB          F      1646
            M      1216
PE          M       698
            F       579
PF          M       816
            F       757
PH          F        21
            M        11
PI          M         8
PL          M        19
            F        16
PM          M       501
            F       382
PP          F      1608
            M      1468
PX          F         1
            M         1
RF          F        57
            M        18
RM          M      1349
            F      1199
RO          F         4
            M         4
RX          M         2
SF          M        23
            F        17
SH          F        78
            M        65
SO          F        32
            M        11
SS          M         2
            F         1
Name: sex, dtype: int64

# ¿Cuánto tiempo pasó desde que se observó la primera vez una especie hasta que se observó la última?

In [ ]:
base_actualizada.groupby('species_id')["date"].last()-base_actualizada.groupby('species_id').date.first()

species_id
AB    7906 days
AH    9000 days
AS     566 days
BA    1179 days
CB    7766 days
CM    2569 days
CQ    1333 days
CS       0 days
CT       0 days
CU       0 days
CV       0 days
DM    9299 days
DO    9265 days
DS    8178 days
DX    8154 days
NF       0 days
NL   14679 days
NM       0 days
OL    9207 days
OT    9298 days
OX    5663 days
PB    2656 days
PC    5880 days
PE    9299 days
PF    9299 days
PG    6246 days
PH    4789 days
PI    3603 days
PL    1653 days
PM    8873 days
PP    9299 days
PU    3816 days
PX    1412 days
RF    5463 days
RM    9206 days
RO    4187 days
RX     856 days
SA    7092 days
SC       0 days
SF    5012 days
SH    9187 days
SO    2187 days
SS    9184 days
ST       0 days
SU     141 days
UL    2196 days
UP     973 days
UR    5376 days
US       0 days
ZL      28 days
Name: date, dtype: timedelta64[ns]

# **8. Limpiando nuestros datos (importante!)**

1. dropna
  * quitar filas con NaN
  * Quitar columnas con NaN
2. rellenar NaN
  *  Usar media
  *  Usar mediana
  *  Usar moda
  *  Usar desviación estandar
  *  Interpolaciones?? 

**¿Qué es mejor?**

No hay respuesta única.

In [ ]:
df_conNaN = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [5, np.nan, np.nan, 6],
                   [np.nan, 4, np.nan, 5]],
                 columns=list('PQRS'))
display(df_conNaN)

     P    Q   R  S
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  5.0  NaN NaN  6
3  NaN  4.0 NaN  5

```df['columna'].fillna(self, value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)```
*   **value**: un valor, un escalar, un número, un diccionario, un arreglo u otro dataframe.
*  **method**: 
   *  pad / ffill: repite el último valor válido hasta el siguiente valor válido.
   *  backfill / bfill: usa el siguiente valor válido hasta llegar a un valor válido.
* **axis** = 0 o 1, esto dice si quiero llenar las columnas (1) o las filas (0).
*  **inplaces**: reemplaza mi dataframe por el nuevo dataframe.


Para más información consultar [aquí.](https://www.w3resource.com/pandas/series/series-fillna.php#:~:text=The%20fillna()%20function%20is,values%20using%20the%20specified%20method.&text=Value%20to%20use%20to%20fill,DataFrame%20will%20not%20be%20filled.)

1. Vamos a completar la columna "R" con el valor 0.

In [ ]:
df_R = df_conNaN.copy()
df_R["R"].fillna(0, inplace=True)
df_R

     P    Q    R  S
0  NaN  2.0  0.0  0
1  3.0  4.0  0.0  1
2  5.0  NaN  0.0  6
3  NaN  4.0  0.0  5

2. Completar cada columna con un valor distinto dado por un diccionario.

In [ ]:
df_fila3 = df_conNaN.copy()
values = {'P': 0, 'Q': 1, 'R': 2, 'S': 3}
df_fila3.fillna(value=values, inplace=True)
df_fila3

     P    Q    R  S
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  5.0  1.0  2.0  6
3  0.0  4.0  2.0  5

3. Completar una columna con la media de esa columna.

In [ ]:
import numpy as np
df_media = df_conNaN.copy()
print("La media de la columna Q es:", df_media["Q"].mean())
df_media['Q'].fillna(value = df_media['Q'].mean(), inplace=True)
df_media

La media de la columna Q es: 3.3333333333333335

     P         Q   R  S
0  NaN  2.000000 NaN  0
1  3.0  4.000000 NaN  1
2  5.0  3.333333 NaN  6
3  NaN  4.000000 NaN  5

4. Usaremos el método pad / ffill

In [ ]:
df_ffill= df_conNaN.copy()
df_ffill.fillna(method = "ffill", inplace=True)
df_ffill

     P    Q   R  S
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  5.0  4.0 NaN  6
3  5.0  4.0 NaN  5

5. Usaremos el método backfill / bfill.

In [ ]:
df_bfill= df_conNaN.copy()
df_bfill.fillna(method = "bfill", inplace=True)
df_bfill

     P    Q   R  S
0  3.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  5.0  4.0 NaN  6
3  NaN  4.0 NaN  5

6. Quitar las filas/columnas que tengan NaN. Aquí hay que tener cuidado pues podemos perder muchas observaciones.

In [ ]:
df_sincolumnas = df_conNaN.copy()
df_sincolumnas.dropna(axis=1, inplace=True)
df_sincolumnas

   S
0  0
1  1
2  6
3  5

In [ ]:
df_sinfilas = df_conNaN.copy()
df_sinfilas.dropna(axis=0, inplace=True)
df_sinfilas

Empty DataFrame
Columns: [P, Q, R, S]
Index: []